nxp-mcuxpresso/mcux-soc-svd/KW45B41Z83/KW45B41Z83.xml
        <register>
          <name>CIU2_BCA1_CPU2_INT_MASK</name>
          <description>BCA1 to CPU2 Interrupt Mask</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>imr</name>
              <description>Interrupt Mask for BCA1 to CPU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BCA1_CPU2_INT_SELECT</name>
          <description>BCA1 to CPU2 Interrupt Select</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rsr</name>
              <description>Interrupt Read/Write Clear for BCA1 to CPU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BCA1_CPU2_INT_EVENT_MASK</name>
          <description>BCA1 to CPU2 Interrupt Event Mask</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>smr</name>
              <description>Interrupt Event Mask for BCA1 to CPU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BCA1_CPU2_INT_STATUS</name>
          <description>BCA1 to CPU2 Interrupt Status</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>isr</name>
              <description>BCA1 to CPU2 Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_APU_BYPASS1</name>
          <description>CIU2 APU Bypass Register 1</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>brf_clk_en_bypass_en</name>
              <description>Firmware Bypass BRF_Clk_En</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_clk_en_bypass_val</name>
              <description>Firmware Bypass Value for BRF_Clk_En (active high signal)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_aes_clk_en_bypass_en</name>
              <description>Firmware Bypass for Btu_Aes_Clk</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_aes_clk_en_bypass_val</name>
              <description>Firmware Bypass Value for Btu_Aes_Clk</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>soc_clk_en2_T1_bypass_en</name>
              <description>Firmware Bypass for SoC_Clk_En2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>soc_clk_en2_T1_bypass_val</name>
              <description>Firmware Bypass Value for SoC_Clk_En2(active high signal)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tbg_btu_clk_en_bypass_sel</name>
              <description>TBG512_320_176_BTU_Clk_En_Sel to TBG512_320_176 of CAU</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_aes_clk_sel_bypass_en</name>
              <description>Firmware Bypass for Btu_Aes_Clk_Sel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_aes_clk_sel_bypass_val</name>
              <description>Firmware Bypass Value for Btu_Aes_Clk_Sel</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tbg_btu_clk_en_bypass_val</name>
              <description>TBG512_320_176_BTU_Clk_En Bypass Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_LMU_STA_BYPASS0</name>
          <description>LMU static bank control byapss0 Register for CPU2 mem</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lmu_sta_banks_iso_en_bp_en</name>
              <description>Firmware Bypass enable for lmu static banks iso_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_iso_en_bp_val</name>
              <description>Firmware Bypass value for lmu static banks iso_en</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_psw_en_bp_en</name>
              <description>Firmware Bypass enable for lmu static banks psw_en</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_psw_en_bp_val</name>
              <description>Firmware Bypass value for lmu static banks psw_en</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_LMU_STA_BYPASS1</name>
          <description>LMU static bank control byapss1 Register for CPU2</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lmu_sta_banks_sram_pd_bp_en</name>
              <description>Firmware Bypass enable for lmu static banks sram_pd</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_sram_pd_bp_val</name>
              <description>Firmware Bypass value for lmu static banks sram_pd</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_fnrst_bp_en</name>
              <description>Firmware Bypass enable for lmu static banks fnrst</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_fnrst_bp_val</name>
              <description>Firmware Bypass value for lmu static banks fnrst</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_LMU_STA_BYPASS2</name>
          <description>LMU static bank byapss2 Register for CPU2</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lmu_sta_banks_vddmc_sw_pd_ctrl_bp_en</name>
              <description>Firmware Bypass enable for lmu static banks vddmc_sw_pd_ctrl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_sta_banks_vddmc_sw_pd_ctrl_bp_val</name>
              <description>Firmware Bypass value for lmu static banks vddmc_sw_pd_ctrl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_LMU_G2BIST_CTRL_BYPASS</name>
          <description>LMU G2Bist control byapss Register for CPU2</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lmu_cpu2_sta_pwrdmn_rpr_req_bp_en</name>
              <description>Firmware Bypass enable for CPU2 static banks lmu powerdomain repair request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lmu_cpu2_sta_pwrdmn_rpr_req_bp_val</name>
              <description>Firmware Bypass value for CPU2 static banks lmu powerdomain repair request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_APU_PWR_CTRL_BYPASS1</name>
          <description>APU power control Bypass Register 1</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2EE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>brf_psw_bypass_val</name>
              <description>brf Power Switch Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_psw_bypass_en</name>
              <description>brf Power Switch Control Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_fwbar_bypass_val</name>
              <description>brf Firewallbar Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_fwbar_bypass_en</name>
              <description>brf Firewallbar Control Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_iso_en_bypass_val</name>
              <description>brf Isolation Cell Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_iso_en_bypass_en</name>
              <description>brf Isolation Cell Control Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_clk_div_rstb_bypass_val</name>
              <description>Firmware Bypass Value for brf Clk_Div_Rstb (active low signal)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_clk_div_rstb_bypass_en</name>
              <description>Firmware Bypass brf Clk_Div_Rstb from APU</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_sram_pd_bypass_val</name>
              <description>Firmware Bypass Value for SRAM_PD (active high signal)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_sram_pd_bypass_en</name>
              <description>Firmware Bypass SRAM_PD from APU</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_AHB2AHB_BRIDGE_CTRL</name>
          <description>AHB2AHB Bridge Control Register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>prefetch_hsel_en</name>
              <description>ahb2ahb bridge pre-fetch hsel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_AHB1_AHB2_TO_CLEAR</name>
          <description>AHB1 AHB2 timeout logic clear register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ahb2_timeout_clear</name>
              <description>After the timeout happended on AHB2 bus, the cpu will read the ERR ISR and read the bus state which cause the timeout and then set this bit to 1 to clear the AHB2 timeout logic to start recroding next transaction. This is self clearing bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_dcode_inv_addr_clr</name>
              <description>After the invalid address int happended on CPU2 dcode bus, the cpu2 will read the ERR ISR and read the bus state which cause the timeout and then set this bit to 1 to clear the CPU2 Dcode invalid addr logic to start recroding next transaction. This is self clearing bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_icode_inv_addr_clr</name>
              <description>After the invalid address int happended on CPU2 icode bus, the cpu2 will read the ERR ISR and read the bus state which cause the timeout and then set this bit to 1 to clear the CPU2 Icode invalid addr logic to start recroding next transaction. This is self clearing bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU_CPU2_DBG_STAT</name>
          <description>CPU2 debug register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_ro_status</name>
              <description>cpu2 debug output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU_CPU1_CTRL</name>
          <description>CPU1 control register</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_jtag_chain_bypass</name>
              <description>1 = Bypass the JTAG chain of CPU1 0 = The CPU1 remains in JTAG chain This bit is backup in case the CPU1 doesn't work on silicon</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_cpu2_msg_scheme</name>
              <description>1 = new IMU based scheme (default) 0 = old ciu reg based scheme</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_reset_int</name>
              <description>cpu1 fw reset cpu2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_TESTBUS_CTRL</name>
          <description>CPU2 debug register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_sel</name>
              <description>Select testbus debug output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_LBC_CTRL</name>
          <description>LBC Control and Status</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lbc_nco_en</name>
              <description>LBC NCO Enable Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lbc_debug_ctrl</name>
              <description>LBC Debug Control Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dejit_en</name>
              <description>De-jitter Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_dejit</name>
              <description>Auto de-jitter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>man_sel_nco</name>
              <description>Manual select NCO</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nco_lpo_ramp_dn</name>
              <description>Status nco_lpo_ramp_dn</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ref_lpo_clk_good</name>
              <description>Status ref_lpo_clk_good</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ref_lpo_ramp_dn</name>
              <description>Status ref_lpo_ramp_dn</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>lpo_clk_sel_fsm</name>
              <description>Status lpo_clk_sel_fsm</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>lpo_clk_3k2_cnt</name>
              <description>Status lpo_clk_3k2_cnt, 3.2KHz Count</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_LBC_SLPCLK_NCO</name>
          <description>LBC NCO Step for Sleep Clock</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x19000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>step</name>
              <description>LBC NCO step for sleep clock. Please refer to design spreadsheet for more details.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
