nxp-mcuxpresso/mcux-soc-svd/KW45B41Z83/KW45B41Z83.xml
        <register>
          <name>XO_DIST</name>
          <description>RF Analog XO DIST Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XO_DIST_TRIM</name>
              <description>reg_xo_dist_trim_dig[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_0</name>
                  <description>0.9 V ( Default )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_1</name>
                  <description>0.86 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_2</name>
                  <description>0.95 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_3</name>
                  <description>1.21 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_DIST_FLIP</name>
              <description>reg_xo_dist_flip_dig</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_DIST_FLIP_0</name>
                  <description>XO DIST doesn't flip the output clock relative to input clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_FLIP_1</name>
                  <description>XO DIST flip the output clock relative to input clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_DIST_BYPASS</name>
              <description>reg_xo_dist_bypass</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_DIST_BYPASS_0</name>
                  <description>XO DIST not bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_BYPASS_1</name>
                  <description>XO DIST bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL</name>
          <description>RF Analog PLL Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_TRIM_KVT</name>
              <description>reg_vco_trim_kvt_dig[2:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_0</name>
                  <description>50MHz/V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_4</name>
                  <description>60MHz/V for fref = 32M</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_6</name>
                  <description>70MHz/V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_7</name>
                  <description>80MHz/V for fref = 26M</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_EN_PKDET</name>
              <description>reg_vco_en_pkdet_dig</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_EN_PKDET_0</name>
                  <description>PKDET disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_EN_PKDET_1</name>
                  <description>PKDET enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PD_EN_VPD_PULLDN</name>
              <description>reg_pd_en_vpd_pulldn_dig</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLDN_0</name>
                  <description>not pull down vpd output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLDN_1</name>
                  <description>pull down vpd output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PD_EN_VPD_PULLUP</name>
              <description>reg_pd_en_vpd_pullup_dig</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLUP_0</name>
                  <description>not pull up vpd output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLUP_1</name>
                  <description>pull up vpd output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PD_TRIM_FCAL_BIAS</name>
              <description>reg_pd_trim_fcal_bias_dig[1:0]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_0</name>
                  <description>0.276V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_1</name>
                  <description>0.164V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_2</name>
                  <description>0.320V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_3</name>
                  <description>0.391V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_FCAL_EN_STATIC_RES</name>
              <description>reg_fcal_en_static_res_dig</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_FCAL_EN_STATIC_RES_0</name>
                  <description>resistor is dynamically switched during FCAL operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_FCAL_EN_STATIC_RES_1</name>
                  <description>resistor is always on during FCAL operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_0</name>
          <description>RF Analog RX Control0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_LNA_ITRIM</name>
              <description>reg_rx_lna_itrim_dig[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_0</name>
                  <description>3.7u -25%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_1</name>
                  <description>4.4u -15%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_2</name>
                  <description>5.1u Default</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_LNA_ITRIM_3</name>
                  <description>5.6u +10%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_LNA_PTAT_FORCE_START</name>
              <description>reg_rtfe_ptat_force_dig</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MIX_VBIAS</name>
              <description>reg_rx_mix_vbias_dig[1:0]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_0</name>
                  <description>0.800V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_1</name>
                  <description>0.742V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_2</name>
                  <description>0.689V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MIX_VBIAS_3</name>
                  <description>0.857V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TRIM</name>
              <description>reg_adc_trim_dig[1:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TRIM_0</name>
                  <description>0.965V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIM_1</name>
                  <description>0.935V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIM_2</name>
                  <description>0.905V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIM_3</name>
                  <description>0.875V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_INVERT_CLK</name>
              <description>reg_adc_invert_clk_dig</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_INVERT_CLK_0</name>
                  <description>not invert clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_INVERT_CLK_1</name>
                  <description>invert clk</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_1</name>
          <description>RF Analog RX Control1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x22008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_TYPE</name>
              <description>reg_cbpf_type_dig</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TYPE_0</name>
                  <description>Real</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TYPE_1</name>
                  <description>Complex,</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_TRIM_I</name>
              <description>reg_cbpf_trim_i_dig[1:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_0</name>
                  <description>5u (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_1</name>
                  <description>6.25u</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_2</name>
                  <description>7.5u</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_I_3</name>
                  <description>8.75u</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_TRIM_Q</name>
              <description>reg_cbpf_trim_q_dig[1:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_0</name>
                  <description>5u (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_1</name>
                  <description>6.25u</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_2</name>
                  <description>7.5u</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_Q_3</name>
                  <description>8.75u</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_VCM_TRIM</name>
              <description>reg_cbpf_vcm_trim_dig[1:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_0</name>
                  <description>480mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_1</name>
                  <description>453mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_2</name>
                  <description>426mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_VCM_TRIM_3</name>
                  <description>401mV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPF_TRIM_SHORT_DCBIAS</name>
              <description>reg_cbpf_trim_short_dcbias_dig[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_0</name>
                  <description>470mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_1</name>
                  <description>438mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_2</name>
                  <description>413mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_TRIM_SHORT_DCBIAS_3</name>
                  <description>385mV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
