nxp-mcuxpresso/mcux-soc-svd/KW45B41Z83/KW45B41Z83.xml
        <register>
          <name>COMP5</name>
          <description>FlashPatch Comparator Register 5</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP6</name>
          <description>FlashPatch Comparator Register 6</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP7</name>
          <description>FlashPatch Comparator Register 7</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PID4</name>
          <description>Peripheral Identification Register 4.</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JEP106</name>
              <description>JEP106 continuation code.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>c4KB</name>
              <description>4KB Count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID5</name>
          <description>Peripheral Identification Register 5.</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>PID6</name>
          <description>Peripheral Identification Register 6.</description>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>PID7</name>
          <description>Peripheral Identification Register 7.</description>
          <addressOffset>0xFDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>PID0</name>
          <description>Peripheral Identification Register 0.</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PartNumber</name>
              <description>Part Number [7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID1</name>
          <description>Peripheral Identification Register 1.</description>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xB0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PartNumber</name>
              <description>Part Number [11:8]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JEP106_identity_code</name>
              <description>JEP106 identity code [3:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID2</name>
          <description>Peripheral Identification Register 2.</description>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JEP106_identity_code</name>
              <description>JEP106 identity code [6:4]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Revision</name>
              <description>Revision</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID3</name>
          <description>Peripheral Identification Register 3.</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CustomerModified</name>
              <description>Customer Modified.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RevAnd</name>
              <description>RevAnd</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID0</name>
          <description>Component Identification Register 0.</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Preamble</name>
              <description>Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID1</name>
          <description>Component Identification Register 1.</description>
          <addressOffset>0xFF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Preamble</name>
              <description>Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ComponentClass</name>
              <description>Component class</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ComponentClass_1</name>
                  <description>ROM table.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ComponentClass_9</name>
                  <description>CoreSight component.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ComponentClass_15</name>
                  <description>PrimeCell of system component with no standardized register layout, for backward compatibility.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CID2</name>
          <description>Component Identification Register 2.</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Preamble</name>
              <description>Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID3</name>
          <description>Component Identification Register 3.</description>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xB1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Preamble</name>
              <description>Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
